
&НаСервере
Процедура ПолучитьТДНаСервере(ТабДок)
	
	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-000864");
	ДатаРасчета = Дата(2016,8,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,6,30);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, Истина,НаборВидовРасчета);
	
	пОбъект = РеквизитФормыВЗначение("Объект");
	пОбъект.ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТД(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПолучитьТДНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПолучитьТД_ПениНаСервере(ТабДок)
	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-000864");
	ДатаРасчета = Дата(2016,8,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,6,30);
	НаборВидовРасчета = Неопределено;	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Истина);
									
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	пОбъект = РеквизитФормыВЗначение("Объект");	
	пОбъект.ВыводПрямогоРезультатвТД(Состав, ТабДок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТД_Пени(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПолучитьТД_ПениНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры


