Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем СериализаторMXL;
Перем УтвержденияПроверкаТаблиц;
Перем ТабДок_Эталон;
Перем ТабДок_ДляАнализа;


#Область ИнтерфейсТестирования

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	СериализаторMXL = КонтекстЯдра.Плагин("СериализаторMXL");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	ОписанияТестов = Новый Массив;
	// Пример заполнения ОписанияТестов, может быть либо просто Имя теста, либо параметризуемый тест
	//1. ОписанияТестов.Добавить("ТестДолжен_");
	//2. лПараметры = Новый Структура("ПредставлениеТеста,ИмяТеста,Транзакция,Параметр", ПредставлениеТеста, имяТеста, Истина, МетаФорма_ПолноеИмя);
	//	 ОписанияТестов.Добавить(лПараметры);
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_185690001");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_185690001");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_32000");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_32000");

	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_14303");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_14303");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_6105");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_6105");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_184030001");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_184030001");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_185680001");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_185680001");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_185570001");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_185570001");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_58280001");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_58280001");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_001080");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_001080");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_000609");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_000609");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_001408");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_001408");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_58210065");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_58210065");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_001417");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_001417");
	
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_000864");
	ОписанияТестов.Добавить("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_000864");
	
	ДобавитьОписанияТестовВНаборТестов(НаборТестов, ОписанияТестов);

КонецПроцедуры

Процедура ДобавитьОписанияТестовВНаборТестов(НаборТестов, ОписанияТестов)
	Для Каждого Описание Из ОписанияТестов Цикл
		Если ТипЗнч(Описание) = Тип("Строка") Тогда
			НаборТестов.Добавить(Описание);
		Иначе
			НаборТестов.Добавить(Описание.ИмяТеста, НаборТестов.ПараметрыТеста(Описание.Параметр), Описание.ПредставлениеТеста);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
	НачатьТранзакцию();
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	Если ТранзакцияАктивна() Тогда
		ОтменитьТранзакцию();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти


#Область БлокUnitТестов

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_185690001() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("185690001");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2014,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, ,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_185690001", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_185690001() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("185690001");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2014,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Ложь);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_185690001", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_32000() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("32000");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, ,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_32000", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_32000() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("32000");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Ложь);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_32000", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_14303() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("14303");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, ,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_14303", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_14303() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("14303");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Ложь);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_14303", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_6105() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("6105");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2014,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, ,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_6105", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_6105() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("6105");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2014,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Ложь);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_6105", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_184030001() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("184030001");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2014,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, ,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_184030001", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_184030001() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("184030001");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2014,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Ложь);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_184030001", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_185680001() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("185680001");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2014,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, ,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_185680001", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_185680001() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("185680001");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2014,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Ложь);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_185680001", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_185570001() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("185570001");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2014,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, ,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_185570001", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_185570001() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("185570001");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2014,1,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Ложь);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_185570001", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_58280001() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("58280001");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, Истина,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_58280001", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_58280001() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("58280001");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Истина);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_58280001", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_001080() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-001080");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, Истина,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_001080", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_001080() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-001080");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Истина);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_001080", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_000609() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-000609");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, Истина,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_000609", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_000609() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-000609");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Истина);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_000609", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_001408() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-001408");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, Истина,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_001408", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_001408() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-001408");
	ДатаРасчета = Дата(2016,10,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,8,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Истина);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_001408", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_58210065() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("58210065");
	ДатаРасчета = Дата(2016,11,30);
	НачалоПериода = Дата(2015,5,1);
	КонецПериода = Дата(2016,10,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, Истина,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_58210065", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_58210065() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("58210065");
	ДатаРасчета = Дата(2016,11,30);
	НачалоПериода = Дата(2015,5,1);
	КонецПериода = Дата(2016,10,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Истина);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_58210065", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_001417() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-001417");
	ДатаРасчета = Дата(2016,11,30);
	НачалоПериода = Дата(2015,5,1);
	КонецПериода = Дата(2016,10,31);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, Истина,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_001417", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_001417() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-001417");
	ДатаРасчета = Дата(2016,11,30);
	НачалоПериода = Дата(2015,5,1);
	КонецПериода = Дата(2016,10,31);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Истина);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_001417", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_000864() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-000864");
	ДатаРасчета = Дата(2016,8,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,6,30);
	НаборВидовРасчета = Неопределено;
	рцПИРаботаСервер.ПолучитьБлокДанныхДляСправкиПоЗадолженности(СтруктураДанных, ЛицевойСчет, ДатаРасчета, НачалоПериода, КонецПериода, Истина,НаборВидовРасчета);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводДЗвТД(СтруктураДанных.ДетализацияПоЗадолженности, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Задолженности_ЕжемесПеня_11_000864", ТабДок_ДляАнализа);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_000864() Экспорт

	СтруктураДанных = Новый Структура;
	ЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду("11-000864");
	ДатаРасчета = Дата(2016,8,29);
	НачалоПериода = Дата(2015,12,1);
	КонецПериода = Дата(2016,6,30);
	НаборВидовРасчета = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ссылка",Документы.рцРаботаСИсками.ПустаяСсылка());
	ПараметрыОтбора.Вставить("Тип",Перечисления.рцВидыДокументовПИР.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ДатаРасчета",ДатаРасчета);
	ПараметрыОтбора.Вставить("ДатаМероприятий",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаДвиженияИсков",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРаботыСИскам",Дата(1,1,1));
	ПараметрыОтбора.Вставить("ДатаРеестраДебиторов",Дата(1,1,1));
	ПараметрыОтбора.Вставить("НаборВидовРасчета",Справочники.ркНаборыВидовРасчета.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ТипДокумента",Перечисления.рцТипыОперацийПодачаИска.ПодачаИска);
	ПараметрыОтбора.Вставить("НачалоПериода",НачалоПериода);
	ПараметрыОтбора.Вставить("КонецПериода",КонецПериода);
	ПараметрыОтбора.Вставить("СрокЗадолженности",0);
	ПараметрыОтбора.Вставить("СуммаОсновногоДолга",0);
	ПараметрыОтбора.Вставить("ТарифСудебныхРасходов",0);
	
	// Использовать ежемесячное начисления пени
	ПараметрыОтбора.Вставить("НаборВидовРасчетаПени", Неопределено);
	ПараметрыОтбора.Вставить("ИспользоватьНачисленнуюПеню", Истина);
	
	ПараметрыОтбора.Вставить("ЛицевыеСчета",ЛицевойСчет);	
	Состав = Неопределено;
	рцПИРаботаСервер.ЗаполнитьСоставДолжниковПоПараметрамОтбора(Состав,ПараметрыОтбора);
	
	ТабДок_ДляАнализа = Новый ТабличныйДокумент;
	ВыводПрямогоРезультатвТД(Состав, ТабДок_ДляАнализа);
	СравнитьРезультатВыполненияТестаСЭталоном("ТестДолжен_ПроверитьРасчет_Пени_ЕжемесПеня_11_000864", ТабДок_ДляАнализа);
	
КонецПроцедуры

#КонецОбласти


#Область ОбщиеПроцедуры

Процедура СравнитьРезультатВыполненияТестаСЭталоном(пИмяЭталона, РезультатОтчета)
	
	// Получение эталонного отчета
	// Важно эталон получать именно так из-за плясок с кодом языка макета
	МакетЭталона = ПолучитьМакет(пИмяЭталона);
	Эталон = Новый ТабличныйДокумент;
	Эталон.Вывести(МакетЭталона);	
	
	#Если ТолстыйКлиентОбычноеПриложение или ТолстыйКлиентУправляемоеПриложение Тогда

		// Сохранение в файлы mxl
		ИмяФайлаЭталона = ПолучитьИмяВременногоФайла("mxl");
		ИмяФайлаРезультатаОтчета = ПолучитьИмяВременногоФайла("mxl");
		Эталон.Записать(ИмяФайлаЭталона);
		РезультатОтчета.Записать(ИмяФайлаРезультатаОтчета);
			
		// Сравнение файлов
		
		// Если Истина, то будет показано окно демонстрации различий, если файлы различны
		// Использовать только для расследования ошибки, если тест падает на сравнении
		ПоказатьРазличия = Истина;
		
		// ПараметрыСравнения заполняется по необходимости. Если не заполнены, то используются значения по умолчанию платформы
		// Если не указан способ сравнения, будет попытка определить автоматически по расширению файла:
		//  mxl - ТабличныйДокумент
		//  txt,xml - ТекстовыйДокумент
		ПараметрыСравнения = Новый Структура;
		//ПараметрыСравнения.Вставить("ИгнорироватьПустоеПространство", Истина);
		//ПараметрыСравнения.Вставить("УчитыватьРазделителиСтрок", Ложь);
		//ПараметрыСравнения.Вставить("УчитыватьРегистр", Ложь);
		//ПараметрыСравнения.Вставить("СпособСравнения", СпособСравненияФайлов.ТекстовыйДокумент);
		
		Утверждения.ПроверитьРавенствоФайлов(ИмяФайлаЭталона, ИмяФайлаРезультатаОтчета,
			"Ожидали, что результат отчета соответствует эталону", ПараметрыСравнения, ПоказатьРазличия);
	#Иначе
		УтвержденияПроверкаТаблиц.ПроверитьРавенствоТабличныхДокументовТолькоПоЗначениям(Эталон, РезультатОтчета, "Ожидали, что эталон (слева) совпадет с результатом (справа), а они различны!");
			
	#КонецЕсли	

КонецПроцедуры

Процедура ВыводДЗвТД(Результат, ТД) Экспорт

	//Вывод результа
	ОбластьВывода=ТД.ПолучитьОбласть(1,1,1,Результат.Колонки.Количество());
	Для Счетчик=1 по Результат.Колонки.Количество() Цикл
		ОбластьЗаполнения=ОбластьВывода.Область(1,Счетчик,1,Счетчик);
		ОбластьЗаполнения.Параметр=Результат.Колонки[Счетчик-1].Имя;
		ОбластьЗаполнения.Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	КонецЦикла;

	СтрокиПоЗадолженности = Результат.Строки;
	
	ОбщиеИтоги = СтрокиПоЗадолженности[0];
	ОбластьВывода.Параметры.Заполнить(ОбщиеИтоги);
	ТД.Вывести(ОбластьВывода);
	
	Для каждого ИтогиЗаГод Из ОбщиеИтоги.Строки Цикл
		ОбластьВывода.Параметры.Заполнить(ИтогиЗаГод);
		ТД.Вывести(ОбластьВывода);
		Для каждого ДетальнаяСтрока Из ИтогиЗаГод.Строки Цикл
			ОбластьВывода.Параметры.Заполнить(ДетальнаяСтрока);
			ТД.Вывести(ОбластьВывода);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ВыводПрямогоРезультатвТД(Результат, ТД) Экспорт

	ТЗ_Пени = Результат[0].Пени;
	ТЗ_ГП = Результат[0].Госпошлина;
	Колонки_Пени = ТЗ_Пени.Колонки;
	Колонки_Пени.Добавить("СуммаГоспошлины", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	
	//Вывод результа
	ОбластьВывода=ТД.ПолучитьОбласть(1,1,1,ТЗ_Пени.Колонки.Количество());
	Для Счетчик=1 по ТЗ_Пени.Колонки.Количество() Цикл
		ОбластьЗаполнения=ОбластьВывода.Область(1,Счетчик,1,Счетчик);
		ОбластьЗаполнения.Параметр=ТЗ_Пени.Колонки[Счетчик-1].Имя;
		ОбластьЗаполнения.Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	КонецЦикла;
	
	//Выводим данные по ГП
	Для каждого ТекСтрока Из ТЗ_ГП Цикл
		ОбластьВывода.Параметры.Заполнить(ТекСтрока);
		ТД.Вывести(ОбластьВывода);
	КонецЦикла;
	
	//Выводим данные по Пене
	Для каждого ТекСтрока Из ТЗ_Пени Цикл
		ОбластьВывода.Параметры.Заполнить(ТекСтрока);
		ТД.Вывести(ОбластьВывода);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


